[
  {
    "name": "migrate",
    "text": "https://polymc.org/wiki/getting-started/migrating-multimc/",
    "aliases": ["migr", "mmc", "multimc"]
  },
  {
    "name": "thematrix",
    "text": "https://matrix.to/#/#polymc:matrix.org"
  },
  {
    "name": "log",
    "aliases": ["sendlog", "logs"],
    "text": "Please send logs: https://cdn.discordapp.com/attachments/981957331430539267/983680253367058452/1.png https://cdn.discordapp.com/attachments/981957331430539267/983680253715165234/2.png"
  },
  {
    "name": "eta",
    "aliases": ["wen", "when"],
    "text": "Sometime"
  },
  {
    "name": "optifine",
    "aliases": ["of", "optimize", "opticrap", "notfine"],
    "embed": {
      "color": "green",
      "title": "OptiFine",
      "description": "OptiFine is known to cause problems when paired with other mods.\nPlease see [Installing OptiFine Alternatives](https://polymc.org/wiki/getting-started/install-of-alternatives/).\nIf you really want to use OptiFine, see [Installing OptiFine](https://polymc.org/wiki/getting-started/installing-optifine/)"
    }
  },
  {
    "name": "binary-search",
    "aliases": ["thanosmethod"],
    "embed": {
      "color": "blue",
      "title": "Binary Search - method to find mod problems",
      "description": "The binary search is a way of finding a faulty thing among a lot of other things, without having to remove the things one-by-one. This is useful for finding a broken mod among hundreds of mods, without having to spend time testing the mods one-by-one.\nThe procedure is simple:\n1. Remove half of the existing things, and put them aside.\n2. Run the program / game.\n3. Does the issue still exist?\nIf YES: Repeat from step 1 with the current things.\nIF NO: Swap out the current things with the ones set aside, and repeat from step 1.\n4. Repeat this process until the problematic thing/s have been found.\n\n      Credit to the Quilt Community discord and the Forge Discord for these instructions."
    }
  },
  {
    "name": "java",
    "text": "https://polymc.org/wiki/getting-started/installing-java/",
    "aliases": ["j"]
  },
  {
    "name": "legacyjavafixer",
    "text": "MinecraftForge provides a coremod to fix some issues with older Forge versions on recent Java versions. You can download it here: https://dist.creeper.host/FTB2/maven/net/minecraftforge/lex/legacyjavafixer/1.0/legacyjavafixer-1.0.jar",
    "aliases": ["legacyjava", "ljf"]
  },
  {
    "name": "paths",
    "aliases": ["dirs", "locate"],
    "embed": {
      "title": "Data directories",
      "description": "Where PolyMC stores your data (e.g. instances)",
      "color": "blue",
      "fields": [
        {
          "name": "Portable (Windows / Linux)",
          "value": "In the PolyMC folder"
        },
        {
          "name": "Windows",
          "value": "`%APPDATA%/PolyMC`"
        },
        {
          "name": "macOS",
          "value": "`~/Library/Application Support/PolyMC`"
        },
        {
          "name": "Linux",
          "value": "`~/.local/share/PolyMC`"
        },
        {
          "name": "Flatpak",
          "value": "`~/.var/app/org.polymc.PolyMC/data/PolyMC`"
        }
      ]
    }
  },
  {
    "name": "build",
    "text": "https://polymc.org/wiki/development/build-instructions/"
  },
  {
    "name": "why",
    "text": "https://polymc.org/wiki/overview/faq/#why-did-our-community-choose-to-fork https://polymc.org/news/moving-on/",
    "aliases": ["whywaspolymcmade", "mmcdrama", "devlauncher"]
  },
  {
    "name": "rolypoly",
    "text": "https://media.discordapp.net/attachments/985048903126769764/985051373886382100/rollin-time.gif?width=324&height=216",
    "aliases": ["itsrollintime", "rollintime"]
  },
  {
    "name": "whyjava8",
    "embed": {
      "title": "Why does PolyMC ask me to change java version?",
      "description": "Minecraft versions before 1.17 required Java 8 and have issues with newer java, while newer versions require Java 17, so you need to change java version. Some people think Java 8 is very outdated, but it's actually an LTS, it's still getting updates. If one of your mods is weird and requires newer java, you can bypass this going to instance settings-Java and ticking 'Skip java compatibility checks', but be aware of potential issues, such as [random CMEs](https://bugs.mojang.com/browse/MC-149777).",
      "color": "orange"
    },
    "aliases": ["isjava8ancient", "whyispolyforcingme"]
  },
  {
    "name": "update",
    "embed": {
      "title": "Does PolyMC auto-update?",
      "description": "PolyMC auto-updates for macOS using the Sparkle Framework.\n\nWindows auto-updating is WIP for now, you will need to download the installer and run it again. (You will not lose your instances.)\n\nFor Linux, just use your package manager!",
      "color": "blue"
    },
    "aliases": ["updating", "autoupdate"]
  },
  {
    "name": "modupdater",
    "embed": {
      "title": "Mod updater",
      "description": "Mod updating has been introduced in PolyMC 1.4.0! Upgrade if you haven't and you'll be able to use it.",
      "color": "green"
    },
    "aliases": ["mod-update", "modupdate"]
  },
  {
    "name": "curseforge",
    "embed": {
      "title": "What's wrong with CurseForge?",
      "description": "CurseForge added a new option to block third party clients like PolyMC from accessing mod files, and they started to enforce this option lately. We can't allow you to download those mods directly from PolyMC, but PolyMC 1.3.1 and higher have a workaround to let modpacks work: letting you to download those opted out mods manually. We highly encourage asking authors that opted out to stop doing so.",
      "color": "orange"
    },
    "aliases": ["cf", "curse", "cursed", "cursedfrog"]
  },
  {
    "name": "piracy",
    "embed": {
      "title": "We don't tolerate piracy!",
      "description": "PolyMC has always been legal, legitimate & appropriate. We don't and never will have features such as offline login without an official account.",
      "color": "red"
    }
  },
  {
    "name": "whatislinuxexactly",
    "text": "I’d just like to interject for a moment. What you’re refering to as Linux, is in fact, GNU/Linux, or as I’ve recently taken to calling it, GNU plus Linux. Linux is not an operating system unto itself, but rather another free component of a fully functioning GNU system made useful by the GNU corelibs, shell utilities and vital system components comprising a full OS as defined by POSIX.\nMany computer users run a modified version of the GNU system every day, without realizing it. Through a peculiar turn of events, the version of GNU which is widely used today is often called Linux, and many of its users are not aware that it is basically the GNU system, developed by the GNU Project.\nThere really is a Linux, and these people are using it, but it is just a part of the system they use. Linux is the kernel: the program in the system that allocates the machine’s resources to the other programs that you run. The kernel is an essential part of an operating system, but useless by itself; it can only function in the context of a complete operating system. Linux is normally used in combination with the GNU operating system: the whole system is basically GNU with Linux added, or GNU/Linux. All the so-called Linux distributions are really distributions of GNU/Linux!"
  }
]
